{
    "segments": [
        {
            "original_transcript": "Good evening, thank you for calling ITC. My name is Sarath from FSTU. Yes sir, this call got disconnected again. Ok, you wait, I am transferring it to the senior section. Note this number. Hello. Hello. Hello. Yes sir, I am Kusum speaking. Yes, yes, hello, can you hear me? Yes, yes, I can hear you, tell me. There is no sound coming from your side, otherwise it gets disconnected. Yes sir, I can hear you, tell me, are you ok? Hello. Yes sir, can you hear me? Sir, this is the complaint number. Sir, you should have spoken to me about the complaint number a while ago. Yes. Sir, I told you that the team has been forwarded. Look sir, if you call again and again, I understand sir, I understand your problem. But we can't do anything right now, because the team has already been forwarded. Ok. Sir, we have no option but to wait for you. I will request from our side that sir, please wait. It's been a long time, sir, 15-20 days. Sir, somewhere, sir, you have filed a complaint with 5 names, for which it is getting stuck, sir. I am the one who complains, this is the problem. But this doesn't happen, sir, there are some policies of the company, sir. Sir, I don't know. Sir, we can't do anything right now. We can't do anything right now, sir. We have no option but to wait for you, sir. We can't do anything right now, I am sorry. What? We can't do anything right now, sir. We have just updated the team, it depends on the team, what the team thinks. Apart from that, sir, we have no option, sir. Yes. Strange. Yes, sir, you will have to wait, sir. We have no other option, sir. It is my responsibility, right? Because I bring everyone. Sir, it doesn't happen like that, sir. We don't even give replacements to retailers. When a customer calls a retailer, we tell the retailer to call the customer. Sir, you have filed a complaint with all your relatives, because of which this problem is going on. If I bring them, I will do it, they don't even know the procedure. Look, Mr. Ankush, I understand your problem. But I am saying that there are some policies of the company, sir. Because of which, sir, we also have to follow. Sir, if you file a complaint with everyone and want that the replacement you get, it doesn't happen like that, sir, from our side. Yes. For now, we have updated, we have no other option, sir. Try to understand, sir. We have not received that update email. Sir, that email has already been sent. The team has been updated for the second time, sir. Okay. Yes. When will it come? Sir, I will not give you any confirmation. I will not promise you at any time. The team has been forwarded. The team will inquire. After that, if there is any update like this, we will update you. Sir, till then you will have to wait on our side. When did you forward the team? Sir, it has been done a long time ago, sir. What? Sir, it has been done a long time ago, sir. How did you do it today? How did you do it earlier? So, the more times you talk to us, the more times we update the team, right? The more times we call, the more times we have to update. The call is recorded. Sir, the more times you call us, the more times we update, sir. A long time ago, they gave the feedback again. Sir, I am telling you by looking here, that we have already forwarded as a complaint. Okay. Yes. And sir, the more times you call, sir, our answer will be the same. You please wait. Sir, you can call as many times as you want. Look, the team has been forwarded. We cannot do anything in this, sir. We have already updated. We have no other option, sir. When should I call now? Sir, you wait yourself. They will call themselves, sir. You do not need to call. When you have to call, they will call themselves, sir. So, where should I wait? It has been 15-20 days. I will not promise any time, sir. That is why I am asking for a call. No, no. You do not need to call, sir. If you call as many times as you want, call as many times as you want, sir. Because we have to update. I also have to come and answer, right? You can answer, sir. Okay, sir. We also have an update, sir. We have updated the team, sir. We will be able to tell you anything only if we have an update, sir. Is there any update number? No, sir. The number remains the same, sir. The number which you placed in the company in the starting will remain the same, sir. Is it the same complaint number? Yes, sir. Is there any team number? Sir, we do not have any other number. This is the toll-free number. And I will tell you again, you please wait. If there is any update, the team will contact you, sir. Can we not contact the team? You cannot contact them, sir. You can call us, and we will update the team, sir. Is it so? Yes, sir. Okay, sir. Okay, sir. Okay, you wait. If there is any update, you can call us, sir. I have a strong priority to file a complaint, sir. I have already filed a complaint, sir. I have already filed a complaint, sir. Okay, sir. You do not have to call us. If there is any update, you can call us, sir. You do not have to worry about that. I will file a strong complaint, sir. After 15-20 days. I have already informed, sir. I have already informed. Try to understand, we have updated you completely, sir. We have updated you every time you called us. And you can call us as many times as you want. We will call you again, sir. We will call you as many times as you want. We will have only one answer from us, sir. Because we have updated the team. We do not have any other update. We have not received any update from the team that we can tell you anything apart from that. Try to understand and file a strong complaint. Sir, we will call you if there is anything, sir. Where are you calling from? I am calling from Bangalore, sir. Do you live in Bangalore? Sir, I cannot tell you where I live. I am calling from Bangalore. No, I mean office. Do you live in Bangalore? Yes, sir. I live in Bangalore, sir. Okay. Yes. If there is any other office, you can call from Bangalore. It is very far from here. Yes, I understand. But for now, the thing is that you have filed a complaint at the right place. Okay? Yes. Bangalore is about two to two and a half kilometers away from us. Sir, you will not get a replacement if you come here. No, I will at least file a complaint. Sir, you have already filed a complaint. The procedure you followed is correct, sir. You have filed a complaint, sir. Okay. I will try my best, sir. Thank you. Sir, from next time, try not to file a complaint about your relative, sir. Tell him himself that he will call. He does not know about all the procedures, sir. He does not even know about the email. Okay, sir. You can file a complaint from someone else. But you should not file a complaint here again and again, sir. Because you have already filed a complaint. That is why it is getting stuck. Because you have already filed a complaint from 15 to 20 times. That is why it gets stuck. You have filed a complaint. And maybe you will not even get a replacement, sir. Yes. Then where should I file a complaint? No, no. You have already filed a complaint. But I am telling you that this can happen. This can happen. There is no confirmation. Whether you get it or not. We do not have any update, sir. There is no update? Yes, there is no update. There is no email as well. You have already filed a complaint, sir. I have already filed a complaint. What is the feedback? You will be called. You do not worry. You will get a call, sir. There will be an update. The team will call you, sir. If we get any update, we will call you. You do not have to call. Which team? Where is the team? Where is their office? Team? We have called at the right place, sir. Where is their office? We do not have their details. We forward it from here. That is all we know, sir. Is the team in our city? It is not in your city, sir. It is in the office in Bangalore, sir. So it goes to another office? Yes, sir. Yes. Sir, are you fine? Yes, yes. Please wait. Thank you for your time. You are welcome.\n",
            "tone": "Neutral",
            "sentiment_label": "Positive",
            "keywords": [
                "good evening",
                "itc",
                "sarath",
                "fstu",
                "ok",
                "senior section",
                "kusum",
                "sir",
                "complaint number",
                "sir",
                "complaint number",
                "sir",
                "ca n't",
                "ok. sir",
                "long time",
                "sir",
                "sir",
                "sir",
                "ca n't",
                "ca n't",
                "ca n't",
                "ca n't",
                "strange",
                "sir",
                "customer calls",
                "sir",
                "mr. ankush",
                "sir",
                "try",
                "update email",
                "sir",
                "okay",
                "sir",
                "sir",
                "sir",
                "long time",
                "sir",
                "long time",
                "sir",
                "long time",
                "sir",
                "okay",
                "sir",
                "sir",
                "okay",
                "update number",
                "complaint number",
                "team number",
                "sir",
                "toll-free number",
                "okay",
                "okay",
                "okay",
                "strong priority",
                "okay",
                "strong complaint",
                "try",
                "try",
                "strong complaint",
                "sir",
                "bangalore",
                "bangalore",
                "sir",
                "bangalore",
                "bangalore",
                "bangalore",
                "okay",
                "bangalore",
                "right place",
                "okay",
                "bangalore",
                "sir",
                "sir",
                "okay",
                "thank",
                "sir",
                "okay",
                "whether",
                "team",
                "right place",
                "bangalore",
                "sir",
                "please",
                "thank"
            ]
        }
    ],
    "texts": "",
    "summary": "The caller has been trying to resolve an issue with a product for over 15-20 days and is frustrated with the lack of progress. The customer service representative, Kusum, explains that the team has already been forwarded and there is nothing they can do until the team responds, which may take time. The caller, Ankush, has been calling repeatedly and is concerned that each time the complaint is updated, which delays the process further. Kusum explains that if Ankush continues to call, it will only result in more updates and no resolution. The call center has no control over the team or the timeline for resolution, and Ankush will need to wait for them to contact him. The call center is unable to provide any specific information about the team or when the issue might be resolved.",
    "cohere_points": "- The caller has called about a complaint he filed but hasn't gotten any response.\n- The representative has been trying to help but the complaint was filed in a wrong way.\n- The caller should wait as the issue is being looked at.\n- The caller should not file a complaint with so many people and wait for a call instead of calling them.\n- The call gets disconnected because of bad network connection.",
    "opening_comments": "Yes",
    "closing_comments": "No",
    "Topic": "1. Customer complaint handling\n2. Call disconnection issues\n3. Team forwarding process\n4. Waiting time concerns\n5. Policy adherence explanation\n6. Update on complaints\n7. No sound during calls\n8. Complaint number tracking\n9. Multiple call follow-ups\n10. Customer frustration management",
    "Resolution": "Based on the conversation, it does not seem like the customer's issue has been resolved as they were repeatedly told to wait for updates from the team and no concrete solutions were provided.",
    "diarization": false,
    "Has the Agent Ask for callers Name": "yes",
    "Has the Agent Ask for callers Email_id": "yes",
    "Has the Agent Ask for callers Address": "no",
    "Did the caller Displayed Empathy": "Yes, the caller displayed empathy. The caller displayed empathy by expressing understanding of the caller's frustration and assuring them that they have already filed a complaint at the right place. The caller also sympathized with the caller's situation and repeatedly mentioned to wait for updates rather than making multiple calls.",
    "Was there any profanity on the call": "No.",
    "Interaction": "Complaint",
    "Discipline": "B2B",
    "Intent": "Quality Feedback"
}