{
    "segments": [
        {
            "original_transcript": "Thank you for calling ITC, this is officer Marius. Sir, Tamil Nadu district. Okay. We have registered a complaint in this number. Please check the status. Akash? Yes. Give me a minute. I'll check. Okay. Sir, thank you very much. Okay. Sir, haven't you received any call till now? Huh? Sir, haven't you received any call till now? Till now, not even a single time for the past 5 months, no call. I'll check. It's been 5 months. I'll inform the team about this. Sir, how many times do I have to inform the team and register a complaint? Sir, how many times do I have to inform the team and register a complaint? Sir, how many times do I have to inform the team and register a complaint? Sir, it's not an issue at all. You can register a complaint on our shop saying that the shopkeeper has spoken ill of the shopkeeper. You can take the 5 month call details from their network. If they call and say that they have not received a call, I'll do whatever you say. It's an open challenge, sir. So, you didn't receive a call? Sir, how can I not receive a call? We are running a shop, sir. Don't your employees lie? Do they speak the truth? Sir, I didn't mean that. I'm just giving you the information. No, sir. I've registered a complaint more than 5 times. You keep saying that you've registered a complaint. What does this mean? Do you understand? We apologize for this. If you can't give us your phone number, we'll call the executive or representative. We've registered a complaint. You'll get a call. We don't know when it will come. It will come, sir. We don't know if you've done anything. They'll call you and inform you. They've emailed you. They've called you. They've said that you haven't received a call. They'll call you directly. We'll talk to them. We'll find out who's lying and who's speaking the truth. I'm speaking openly. Can your executive speak openly? Tell me. You said that you didn't receive a call. I've given you an open challenge. You register a complaint against my shop. The shopkeeper is lying. Register a complaint against my company. We'll get all the call details. We'll find out if he called or not. Can he take the challenge? I'll talk to him in the conference. If you say that you didn't receive a call, I'll inform the team. How many times will you inform the team? This is the fifth time that I'm calling. If you keep informing the team, won't you inform the other team as well? They've informed the team. They have to take action. You have to wait. You've already waited. How long will they wait? You're running a local company. Are you a local? I don't understand what you're saying. I've already informed the team. They've informed the team. If it's a multinational company, they have to take action within a week or 10 days. Definitely. If you keep talking, what will happen? I understand. You're wasting your time and money. We've already informed the team. We're the ones who register your complaints. You're a waste. You can't do anything. You can't register anything. No, sir. We have registered. No, sir. We have not registered. If you have registered, action should be taken immediately. Action should be taken immediately. Sir, one minute. Your shop name is Sri Star Megamart, right? Shop number 96 South Carr Street. Our team knows that there is no information, sir. That's why we have all the information. We have all the information. We have all the information. But what are you doing? You are not doing anything. We are just registering, sir. The action should be taken immediately. You should get a call back from your company. Sir, you have registered your complaint. Did they contact you? Did your problem get solved? You should get a call back from your company. You are sitting like a useless person. Did you talk to that company again? Tell me. How many other companies are there? They are all calling back. Did you register your complaint? Did the sales person come? Did your problem get solved? What did you do from your side? Tell me. We have registered our complaint, sir. Our team has registered it. Sir, what do you mean by complaint? You keep complaining. You keep raising complaints. Did anyone come and see the complaint? Tell me. Have they been sitting like this without seeing the complaint for 5 months? Definitely, sir. I understand. Or transfer the call to your head. I will talk to him directly, sir. We don't have that option. What other option do we have? Should I register my complaint? Can I give a police complaint saying that I have a complaint from your company? We have informed our team. We will come back. You should not talk about it again. You should not talk about it again. I understand, sir. You should not talk about it again. You should not talk about it again. No one has come here since we have been silent. What happened to your complaint? One minute, sir. We have informed our team that there is no action against the report. This is what you said last time, sir. You recorded what I said and filed a complaint against my shop. Your people will come running and file a complaint. No one will come and talk to me. We will make your mail stand and send it to you. No, sir. This shopkeeper abused me a lot. Take it as a statement. I am ready to open a challenge. Why should I be afraid? If you want to talk, you can talk. You can record what I say. You can say that this shopkeeper abused me and filed a complaint against my company. Everyone will come running and file a complaint. I will show them when you called me. No, sir. You have already confirmed that I did not call you. Sir, are you an educated person? Sir, we are getting updates here. Sir, you are an educated person, right? You are an educated person, right? I am challenging you openly. You can file a complaint. You are calling me again as if you are an uneducated person. You are asking me if I really did not call you. Tell me. Sir, I can only ask you what is updated here. If it is updated here, you can call me once or twice. You can call me five times. If you do not update me again, what will happen? We are updating our side. I will inform my team about this. With high priority, they will come and take action. Okay? Sir, this is what I told you last time. You can check your side. This time, your complaint will be solved. What happened? I am telling you to mail your team that you have not taken action yet. They will definitely take action. Forgive me, sir, I am sorry. Sir, this is the last time. You can record it. Next time, I will register a police complaint. Okay? What is your name, sir? My name is Rohit. I will register a police complaint. You can talk like this. You can record it. I will inform you. I got a call from my side. You are saying that you did not attend. How can I stay without attending? Sir, I am telling you. You said that you did not receive the call. Just confirm it. I will inform you. I did not make any call. I got the information. Just confirm it. I did not tell you. They said that they called. Take their call details, sir. Did you call them on that date? Did you talk to them on that date? Did you take their phone number? That's why I confirmed it to you. If I don't get a call, I will inform the team. I will inform the team about everything you have told me. You don't need to inform them. Just send the voice record to them. All calls will be recorded. Not just one call. Even the incoming calls will be recorded. If the incoming calls are being recorded, does that mean this is a company? The recording will be given to our team by our friends and colleagues. That's why I am talking to you now. I am not giving you wrong information. I am just clarifying. The team has informed me that you have called. I received the call. I just want to confirm with you. Did you get the call or not? Even if I didn't receive the call, I would have called you back. That's the first thing. Simple. They wouldn't have called from a customer number or a customer call center. Normally, the local IAS or SO would have called from their cell phone number. By chance, if they had called, we would have called them back. Even if I didn't receive the call, I would have called you back. If I didn't attend the call, how can this be an issue? Tell me. I will definitely inform the team about this. I will definitely email you this time. I will definitely inform the team about the solution to your complaint. Do you have any expiry products? It's been three years. We have expiry products. We are not getting the right supply. The distributors are not good. Not even a single representative or salesperson has entered our shop. But they are coming to our city. They are going to other shops. Okay, sir. We can see this with our own eyes. Okay, sir. I have informed the team about everything you said. The team will definitely check and take action. Okay, sir. I will definitely inform the team about this. You don't know how long this will take. Am I right? I can't make false promises. That's why your company is a waste company. In other companies, within 24 to 48 hours, a call will come from our team. Or within a week, they will call us. But you don't make false promises. That's why your company is a waste company. That's why you are wasting your time. You are wasting your time. You are wasting your time. That's all. This is a big minus for your company. Okay, sir. Okay, sir. We will find out how long this will take. Okay, sir. Is there anything else I can do for you? No, sir. Okay, sir. Thank you for calling. ",
            "tone": "Neutral",
            "sentiment_label": "Negative",
            "keywords": [
                "thank",
                "itc",
                "marius",
                "sir",
                "tamil nadu",
                "okay",
                "please",
                "akash",
                "'ll check",
                "okay",
                "sir",
                "okay",
                "sir",
                "huh",
                "sir",
                "till",
                "'ll check",
                "sir",
                "sir",
                "sir",
                "sir",
                "open challenge",
                "sir",
                "employees lie",
                "sir",
                "ca n't",
                "phone number",
                "'ll talk",
                "open challenge",
                "call details",
                "'ll talk",
                "wo n't",
                "local company",
                "multinational company",
                "definitely",
                "ca n't",
                "ca n't register",
                "sir",
                "your",
                "shop name",
                "sri",
                "megamart",
                "shop number",
                "carr",
                "sir",
                "useless person",
                "sales person",
                "sir",
                "have",
                "definitely",
                "police complaint",
                "your",
                "everyone",
                "sir",
                "sir",
                "sir",
                "sir",
                "high priority",
                "okay",
                "sir",
                "forgive",
                "sir",
                "police complaint",
                "okay",
                "rohit",
                "police complaint",
                "sir",
                "call details",
                "phone number",
                "n't need",
                "voice record",
                "wrong information",
                "simple",
                "customer number",
                "normally",
                "ias",
                "so",
                "cell phone number",
                "expiry products",
                "expiry products",
                "okay",
                "own eyes",
                "okay",
                "okay",
                "am",
                "ca n't",
                "waste company",
                "waste company",
                "big minus",
                "okay",
                "okay",
                "okay",
                "okay",
                "thank"
            ]
        }
    ],
    "diarization":false,
    "texts": "",
    "summary": "The customer is frustrated that they haven't received any calls from ITC for 5 months, despite repeatedly lodging complaints to that effect. The customer is fed up with being told that the complaint has been registered and wishes for direct action to be taken. The customer is also suspicious that the calls aren't being logged, and that ITC is lying to them. The customer is threatening to register a police complaint unless the issue is resolved promptly. The customer also has expiry products that they haven't been able to sell due to a lack of supply and poor distributors and sales personnel. The customer feels that ITC is a waste of time and that other companies would have resolved the issue much faster. The customer wants ITC to solve the issue of the missed calls and also to address the supply and distribution problems.  The customer is also skeptical that the incoming calls are recorded and that ITC is lying about this as well.  The customer believes that if the calls were recorded, it would be a sign that the company is trustworthy.  The customer is also frustrated that they have to keep following up with ITC and that they are not being provided with any updates.  The customer feels that this is a waste of time and that ITC is not a company that values its customers.",
    "cohere_points": "- Customer complaints that a company has not followed up on his calls\n- Agent tries to assure the customer but the customer gets angrier\n- Agent eventually transfers the call and the new agent seems to help",
    "opening_comments": "Yes",
    "closing_comments": "No",
    "Topic": "1. Complaint registration process\n2. Call status checking\n3. Lack of follow-up\n4. Shopkeeper complaint\n5. Company response time\n6. Action delay\n7. Call recording\n8. Expiry products issue\n9. Distributor communication\n10. Customer service responsiveness",
    "Resolution": "The customer's issue does not appear to be resolved based on this conversation.",
    "Has the Agent Ask for callers Name": "yes",
    "Has the Agent Ask for callers Email_id": "yes",
    "Has the Agent Ask for callers Address": "no",
    "Did the caller Displayed Empathy": "No, the caller did not display empathy in this conversation.",
    "Was there any profanity on the call": "No",
    "Interaction": "Complaint",
    "Discipline": "B2B",
    "Intent": "Taste / Flavour"
}