{
    "segments": [
        {
            "original_transcript": "Good evening. Thank you for calling ITC. My name is Kalandra. How may I help you? Sir, Namaste. Namaste sir. Dhanyavad. Sir, we have already registered a complaint against you. Complaint registered? Okay. Do you have a complaint number? I just wanted to know about the data, sir. Sir, did you register a complaint from this number? Yes, from this number. I will tell you if I get the complaint number. One minute. I will check, sir. Okay. Sir, do you have your mobile number? Yes, sir. I have it. Okay. Is it Krishna? Yes, it is Krishna. Okay. So you have registered a complaint about matters. Yes, sir. So far I have not said anything about the status. Last time we called the NSD. They said they will call the NSD again. We did not do it. You did not do it? We did not do it, sir. We could not wait. Now we are waiting to get the status. Whether you will do it or not, there is no guarantee. For that, what information will you give? I do not know, sir. What is the issue? What is the problem? Sir, we have ordered a mattress on Amazon. Until 5th. Okay. Sir, we have ordered a mattress on Amazon until 5th. We have received it on 8th. Okay. For 10 rupees mattress, they have charged us Rs. 155. For two mattress boxes, Rs. 20. Who did you take? Amazon. I have shared their photo with them. Amazon? Yes, Amazon. I have complained to them that they are renting your company's items at such a high cost. Okay. If they want, they can charge extra for delivery charges. That is not an issue. Okay. But they mentioned MRP as Rs. 180 and said 15% discount. They have sold us the product for Rs. 155. Okay. We have complained about this. Look, they have taken Rs. 150 for items worth Rs. 20. What do you say about this? I have screenshotted all the photos. I have also shared Amazon's price photo. They keep calling us to track the details. We have not been able to solve their problem. Last week, they asked us to give them more time. We cannot wait any longer. Do you think we will get a refund? Or will you take action on Amazon? Sir, it is 406. 406? Yes, sir. It is 206. One pack contains 206 items. Okay. Sir, one pack has been mentioned. One pack contains 200 items. One pack contains 200 items. The total is 400 items. The total is 400 items. Two packs contain 200 items. Two packs contain 400 items? Yes, sir. Two packs contain 200 items. The total is 400 items. MRP has been blacked out. I have shared their photo. MRP has been blacked out. Okay. They have sent it to us. They have sent it to us. They said that they have sent a packet to you. They said that they will forward the complaint to our team. Okay. We cannot wait any longer. It is 30th August. They have sent the complaint. We cannot wait any longer. We cannot wait any longer. We are not waiting for anything. Either you have cheated us to contact Amazon or you have no value for Amazon ITC products. You have no connection with Amazon. You have given the authority to sell ITC products to Amazon. That is all. It is very embarrassing to hear this. I have got so many doubts. Why are you getting so worried? I have got so much pressure. If you had called, I would have called you immediately. I would have recorded everything. I will talk about the proof. I have been working for Amazon for the past 4 years. They told me that they do not know what to do. They have sent me. They have asked me to come and talk to the company. I have done the same work. So, I am telling you. If you had taken the delivery charge, the matter would have been different. I can understand that. They have wrongly mentioned your MRP. It's an illegal act. MRP doesn't come after the pact, right? MRP has been blacked off. It was mentioned in the purse. It has been blacked off. I have shared the photo with you. It is being reflected, sir. Yes, it can be reflected. Check it. Yes, yes. Sir, I will tell you a little bit about this. Can I stay in the hotel for a couple of minutes, sir? I will inform the team, that this issue has been resolved. That's it, sir. I cannot wait any longer. I need to talk to another IRO officer and resolve this issue. I cannot wait any longer. Otherwise, I will file a complaint and close the ITC company. I apologize. I will talk to the team. Give me five minutes. Okay, okay. Thank you, sir. Thank you, sir. Thank you, sir. Thank you, sir. Thank you, sir. Thank you for calling me, sir. Hello. Yes, tell me, sir. How much did you pay, sir? Rs. 155, sir. Rs. 155. Rs. 155. That pack is also Rs. 210, right? Rs. 210. 210 sticks. So, you paid Rs. 10 for the pack. You paid Rs. 155 for the pack. Yes, yes. Rs. 210. Rs. 155. You paid Rs. 155, right? Yes. Did you pay UPA or cash delivery? No, I prepaid. I didn't pay cash delivery. I prepaid. You prepaid. Was it in your wallet? Not in my wallet. I paid by card. By card, okay. So, you paid Rs. 155. Yes, yes. You paid Rs. 155. Yes, but MRP has been scrapped here, sir. So, Rs. 210 packs and most probably Rs. 10 would have gone. Okay? MRP was shown as Rs. 180. That photo was to be placed somewhere else. When I went into the details, that photo came up. I am showing you the amount I paid. Can you send me the photo you paid? Hello. If you send me the photo, how long will you do this? I have shared the details in the order. Delivery, sir. You paid Rs. 155. Send me the photo you paid. I will inform the TV and check your status. I will give you the number. Note it down, sir. What number? WhatsApp number, sir. Give me the WhatsApp number. You have taken a screenshot, sir. You paid Rs. 155, right? Hello? You paid Rs. 155. How will I get it back? Are you asking for the bill photo? This is a screenshot. I don't know what you're talking about, sir. How can I get a screenshot of the payment mode, sir? The payment mode picture... If I want to do the payment mode, I have to go there, right? The details of the order... I'll show you the details of the order. You're asking me how to get a screenshot of the payment mode. Sir, one minute. When you place an order on Amazon... Sir, I don't know much about it. Yes, yes. Tell me. When you place an order... You said you prepaid, right? You have your wallet there. You pay through cards, right? Can you show me a screenshot of the payment mode, sir? You can see the payment mode below. Yes, yes, sir. You can't see the amount there. The amount is above. In the column below... There's a payment mode. I'm telling you. There's a payment mode. There's a payment mode. Yes. You mentioned the last code number and debit card. We can't share all that, sir. Because... It's all personal details. You can show me the photo. Yes, tell me. You said you paid Rs. 155 for two packets, right? You can hide the screenshot and show me the personal details. You can scratch it and show me. You can hide it, right? You can hide it and show me the photo, sir. You can hide the number and show me. But... It's enough if you show me the debit card, right? Yes, and... There's a receipt for the Rs. 155 payment, right? When you make a phone call... There's a receipt in the phone call, right? I'm telling you the same thing. Just show me a screenshot. That's good. Okay. That's good. Okay. That's good. Okay. That's good. Okay. Okay. Which is the last one finally. Okay, sir. Okay, sir. Okay, sir. Okay, sir. Okay. Okay, sir. Okay. Okay. Okay. Okay. Okay. Okay. Okay, sir. Okay. Okay. Okay, sir. Okay, sir. Okay, sir. Okay. Okay, sir. Okay, sir.",
            "tone": "Neutral",
            "sentiment_label": "Positive",
            "keywords": [
                "good evening",
                "thank",
                "itc",
                "kalandra",
                "sir",
                "namaste",
                "namaste",
                "dhanyavad",
                "sir",
                "complaint",
                "okay",
                "complaint number",
                "sir",
                "complaint number",
                "okay",
                "sir",
                "mobile number",
                "okay",
                "krishna",
                "krishna",
                "okay",
                "nsd",
                "nsd",
                "whether",
                "sir",
                "amazon",
                "okay",
                "sir",
                "amazon",
                "okay",
                "rupees mattress",
                "rs",
                "mattress boxes",
                "rs",
                "who",
                "amazon",
                "amazon",
                "amazon",
                "company 's items",
                "high cost",
                "okay",
                "delivery charges",
                "okay",
                "mrp",
                "rs",
                "% discount",
                "rs",
                "okay",
                "rs",
                "items worth",
                "rs",
                "amazon",
                "'s price photo",
                "amazon",
                "sir",
                "pack contains",
                "okay",
                "sir",
                "pack contains",
                "pack contains",
                "mrp",
                "mrp",
                "okay",
                "okay",
                "august",
                "either",
                "amazon",
                "amazon itc",
                "amazon",
                "itc",
                "amazon",
                "amazon",
                "delivery charge",
                "mrp",
                "illegal act",
                "mrp",
                "mrp",
                "sir",
                "iro",
                "otherwise",
                "itc",
                "okay",
                "thank",
                "thank",
                "thank",
                "thank",
                "thank",
                "thank",
                "rs",
                "rs",
                "rs",
                "rs",
                "rs",
                "rs",
                "rs",
                "rs",
                "rs",
                "rs",
                "upa",
                "cash delivery",
                "n't pay cash delivery",
                "was",
                "rs",
                "rs",
                "mrp",
                "rs",
                "rs",
                "okay",
                "mrp",
                "rs",
                "delivery",
                "rs",
                "whatsapp",
                "whatsapp",
                "rs",
                "rs",
                "bill photo",
                "payment mode",
                "payment mode picture ...",
                "payment mode",
                "order ...",
                "'ll show",
                "payment mode",
                "sir",
                "amazon",
                "sir",
                "order ...",
                "payment mode",
                "payment mode",
                "ca n't",
                "payment mode",
                "payment mode",
                "payment mode",
                "code number",
                "debit card",
                "ca n't share",
                "personal details",
                "rs",
                "personal details",
                "debit card",
                "rs",
                "okay",
                "okay",
                "okay",
                "okay",
                "okay",
                "okay",
                "okay",
                "okay",
                "okay",
                "okay",
                "okay",
                "okay",
                "okay",
                "okay",
                "okay",
                "okay",
                "okay",
                "okay",
                "okay",
                "okay",
                "okay",
                "okay",
                "okay",
                "okay",
                "okay",
                "okay"
            ]
        }
    ],
    "diarization":false,
    "texts": "",
    "summary": "A caller discusses a complaint he made to ITC regarding a mattress he ordered through Amazon. The caller was charged Rs. 155 for a Rs. 20 item and wants to know the status of his complaint and if he will receive a refund. The customer service representative checks the complaint and informs the caller that they will forward the complaint to their team. The caller becomes agitated and tells the representative that if they do not take action, he will file a complaint against ITC and close the company. The representative apologizes and promises to forward the complaint to the relevant team. The caller then provides screenshots of the order and payment to the representative. The caller is then put on hold and the recording of the call ends.",
    "cohere_points": "- A customer calls an ITC employee to know about the status of his complaint and discusses an issue with an Amazon seller. \n- The customer bought a mattress on Amazon\n- He was charged Rs. 155 for a Rs. 20 worth item which he prepaid through his debit card\n- The employee asks the customer to send a screenshot of the payment mode\n- The employee will inform the team and resolve the issue.",
    "opening_comments": "Yes",
    "closing_comments": "No",
    "Topic": "1. Customer Complaint\n2. Delayed Delivery\n3. High Charges\n4. Incorrect MRP\n5. Amazon Order\n6. Refund Request\n7. Screen Shot Evidence\n8. Prepaid Payment\n9. Payment Mode Details\n10. Debit Card Information\n11. Personal Details\n12. Receipt Confirmation\n13. Issuing Refund\n14. Customer Service Interaction\n15. Escalating Complaint",
    "Resolution": "The customer's issue has not been resolved yet as additional information requested to verify the payment made.",
    "Has the Agent Ask for callers Name": "yes",
    "Has the Agent Ask for callers Email_id": "no",
    "Has the Agent Ask for callers Address": "no",
    "Did the caller Displayed Empathy": "Yes, the call displayed empathy. The caller displayed empathy by listening attentively to the caller's concerns and offering to help resolve the issue promptly.",
    "Was there any profanity on the call": "No.",
    "Interaction": "Query",
    "Discipline": "Brand",
    "Intent": "Collaboration"
}