{
    "segments": [
        {
            "original_transcript": "Good morning, thank you for calling ITC, my name is... Hello, good morning, good morning. Yes. I have bought a product. Please be online, sir. Are you comfortable in Malayalam language, right? Yes. Please be online. Transferring all to Malayalam agent, okay? Yes. Hello. Yes, sir. Good morning. Good morning, sir. I have bought a product of yours. Okay. Sambarani cups, right? Sambarani cups, okay. Yes, yes. I have bought a packet of those. This is the one we use regularly. Okay. I have bought it from Moral in Patna. From Moral, right? Yes. I have bought it recently. I have burnt it twice. It is not getting completely burnt. Sometimes, it gets burnt. We have burnt two cups. It was not successful. Okay, okay. I am trying my best, sir. I am going to raise a complaint. I am going to forward the complaint to the team. Okay. What do we need in this packet? What do we need in this packet? Do we use it regularly? No, sir. The packet is not available in your hand, sir. I have it in my hand. I need some details of it, sir. Before that, please tell me your full name. Shiva Kumar. Shiva Kumar. Okay, sir. Is this your mobile number? Yes, yes. I don't know the exact details. Do you have any other mobile number, sir? I don't know the exact details. Do you have any other mobile number, sir? This is my mobile number. This is ShivaKumar.com. Okay, okay. You said you don't know the email address in detail, right? What? Do you know the email address in detail, sir? No. It is written as ShivaKumar.com. No, sir. It is written as Gmail.com. I will ask you some other details. Do you have this mobile number or any other number, sir? Do you have this mobile number or any other number, sir? This is my mobile number. Can you check the front side of the packet? Can you check the front side of the packet? Can you read what is written in it? It is written as Mangal Deep Power of 3 in 1 Power of 3 in 1 Mangal Deep 3 in 1 Is it Agarbathi Cups? Yes, yes. Sambarani Cups with 3 in 1 Fragrance Okay, Sambarani Cups, right? Yes. Sir, I would like to say one thing. All our ITC products and all kinds of quality checks and lab tests are released to the market after the product is released. I have read the directions of our use in it. But if you burn it and keep it, it will be lost. Okay. Sir, tell me. There were no complaints like this when I was using it. Okay. Once I burn it as a complaint, it was good. But after burning it using two cups, I don't burn it continuously. I understand, sir. If there is any problem like this, I will raise a complaint, sir. Sir, behind that packet, is there any manufacturing date or batch number? Can you check and tell me, sir? Yes, I can tell you. In this, the company Sir, on the side or else? On the side, MRP is written. Quality MRP is written in it. It is 75. Is it written in gram or other quantity? Yes. Quantity 9 Sambani cups plus 1 Sambani holder free. Okay. There is a label number in it. Made in India 8 Is there any ATCH number or batch number? It is manufactured by ITC Ltd. There is no batch number in it. Check on both sides, sir. On both sides, Where is it manufactured? Is there any manufacturing date? Store location 52 Manufacturing Manufacturing Manufactured by ITC Ltd. Okay. 37 37 batch number Is there any batch number, sir? B A T C H I can't see anything in it. Check on both sides, sir. There is no batch number. I can't see anything in it. Is there anything written in MRP? There is Rs. 75 written in MRP. There is net quantity. There is a Made in India label number. Computer label number. Sir, can you share the front and back photos of the packets on WhatsApp? Can you share it, sir? It is I can't see anything in it. Can you give the full address? Shivakumar Ramanilayam Pathanapuram Which district is it, sir? Kollam Can you tell the area pin code? 683695 6836 95 Was the packet sealed when you bought it? Yes, the packet was sealed. Can you share the photos, sir? I will send it later. There are no other details available in it, right? There is nothing else. I can't see any batch number in it. There is a marketed by and a manufactured by. Yes, there is a manufactured by. What is that? M A M A M A Ravi R A G Industries Vadagapally Vadagapally Bangalore North Is there any batch number in it? Uttarahalli Hobali Karnataka Bangalore If there is no batch number, I will file a complaint. Can I hold your call for a minute? Yes, you can. Don't disconnect the line. Ok Thank you.\n",
            "tone": "Neutral",
            "sentiment_label": "Positive",
            "keywords": [
                "good morning",
                "itc",
                "good morning",
                "good morning",
                "please",
                "malayalam",
                "please",
                "transferring",
                "malayalam",
                "good morning",
                "good morning",
                "okay",
                "sambarani",
                "sambarani",
                "okay",
                "moral",
                "patna",
                "moral",
                "okay",
                "okay",
                "full name",
                "shiva kumar",
                "shiva kumar",
                "okay",
                "mobile number",
                "exact details",
                "mobile number",
                "exact details",
                "mobile number",
                "mobile number",
                "shivakumar.com",
                "okay",
                "email address",
                "email address",
                "shivakumar.com",
                "gmail.com",
                "mobile number",
                "mobile number",
                "mobile number",
                "front side",
                "front side",
                "mangal deep power",
                "power",
                "mangal deep",
                "agarbathi cups",
                "sambarani cups",
                "fragrance okay",
                "sambarani cups",
                "sir",
                "itc",
                "quality checks",
                "lab tests",
                "okay",
                "sir",
                "okay",
                "n't burn",
                "sir",
                "batch number",
                "sir",
                "mrp",
                "quality mrp",
                "quantity",
                "sambani",
                "sambani",
                "okay",
                "label number",
                "made",
                "india",
                "atch",
                "batch number",
                "itc ltd",
                "batch number",
                "store",
                "manufacturing manufacturing manufactured",
                "itc ltd",
                "okay",
                "batch number",
                "batch number",
                "ca n't",
                "batch number",
                "ca n't",
                "mrp",
                "rs",
                "mrp",
                "net quantity",
                "made",
                "india",
                "label number",
                "computer",
                "label number",
                "sir",
                "whatsapp",
                "ca n't",
                "full address",
                "shivakumar ramanilayam pathanapuram",
                "kollam",
                "area pin code",
                "was",
                "ca n't",
                "batch number",
                "ravi r",
                "vadagapally vadagapally bangalore",
                "batch number",
                "uttarahalli hobali karnataka bangalore",
                "batch number",
                "n't disconnect",
                "ok thank"
            ]
        }
    ],
    "texts": "",
    "summary": "The customer has bought a packet of Sambarani cups and is experiencing problems with them not burning properly. They are speaking with a customer service agent from ITC in Malayalam and are looking to file a complaint. The agent asks for the customer's details, including their full name, mobile number, and any other available contact information. The agent also asks the customer to check for any manufacturing details on the packet, such as a batch number, manufacturing date, or MRP. The customer reports that there is no batch number but provides the agent with the other information requested. The agent then asks the customer to share photos of the front and back of the packet via WhatsApp and also to provide their address. The customer provides their address and the agent proceeds to file the complaint. The agent promises to raise the complaint and offer a resolution at the earliest.",
    "cohere_points": "- A customer has called an ITC customer service centre to register a complaint about their product not burning properly\n- The customer wants to know what they need to do to resolve the issue and if they will get a refund\n- The customer service agent is trying to get further information about the product to share with the complaint team. \n- The customer needs to provide their contact information and details about the product to the agent. \n- The customer is then put on hold so that the agent can file the complaint on their behalf. \n- The key details needed to file the complaint is the address, contact number, name and description of the issue. \n- The call ends with the customer being informed that their complaint has been registered and will be dealt with shortly. In essence, the customer is assisted with a complaint they have raised about a product they bought and is then assured that the issue will be resolved soon.",
    "opening_comments": "Yes",
    "closing_comments": "No",
    "Topic": "1. Customer complaint about product\n2. Sambarani cups issue\n3. Request for details\n4. Manufacturing information\n5. Batch number inquiry\n6. Customer contact details\n7. Request for photos\n8. Sealed packet confirmation\n9. Address details provided\n10. Holding call for complaint",
    "Resolution": "The customer's issue is not fully resolved yet as the batch number needed for filing a complaint was not found on the product.",
    "diarization": false,
    "Has the Agent Ask for callers Name": "yes",
    "Has the Agent Ask for callers Email_id": "yes",
    "Has the Agent Ask for callers Address": "yes",
    "Did the caller Displayed Empathy": "Yes, the caller displayed empathy in sentences like \"I understand, sir,\" \"If there is any problem like this, I will raise a complaint, sir,\" and \"If there is no batch number, I will file a complaint.\"",
    "Was there any profanity on the call": "No",
    "Interaction": "Query",
    "Discipline": "Brand",
    "Intent": "Distributor List"
}