{
    "segments": [
        {
            "original_transcript": "Hello. Hello. Do you talk in Hindi? Yes, tell me. Yes, our packet of E-Pika. Yes. There are big cheats in it. Oh, really sorry. It's not even expired. It's not even expired. Still, there are big cheats in it. Okay, really sorry. I will register a complaint for it. Is the packet with you now? Yes, it's with me now. Okay, tell me your name. Roshikesh Mishra. Pardon? Roshikesh Mishra. Roshikesh? Yes. Roshikesh Mehra. No, Mishra. Roshikesh Mishra. Mishra, Mishra. Hello. Hello. Hello. Yes, did you write your name? Yes, if you have any email id, tell me. I don't have an email id. Okay, tell me the address. Address? Vijayanagar, Hingna Road, Nagpur. Tell me the entire address so that our executive will visit your address to collect the packet from you. Yes. So, I need the entire address for this. You want the entire address? Yes, the entire address. Behind MIDC, Vijayanagar, Hingna Road, Nagpur. Hingna Road. Shri Krishna Nagar. Krishna Mandir, Shri Krishna Nagar. Krishna Mandir. Yes, Shri Krishna Nagar. Shri Krishna Nagar, okay. Do you want a pin code? Yes. 44. 44. 00. 00. 16. 16. Yes. Which packet did you give? Yes. Which variant of IP did you give? The one which costs Rs. 12. Is it Magic Masala or Mood Masala? Which packet is it? No, no, yes, it is Magic Masala. Okay, for Rs. 12? Yes. Okay, tell me its manufacturing date. Manufacturing date is... 23rd May, 2020. 23rd May? Yes. Expiry date? Expiry date is 13th Feb, 2024. Okay. It also has a batch number on it. Tell me that too. It is here, I think. The batch number is on the manufacturing date only. On the manufacturing date? Yes, the batch number is in alphanumeric. YR01RQ01. I can't see it here. Can you see anything on the manufacturing date? It is given on the manufacturing date, Rs. 14.12. Okay. And Rs. is given here. Okay, is there any alphanumeric form next to it? Like YR01RQ03, something like that? Hello. Hello. Hello. Is B number given here? Yes, what is B number? Tell me. BP444. BP? BP444. BP444, okay. Yes. Which shop did you buy this packet from? Yes, I bought it. Which shop did you buy it from? Aditya Khirana. Aditya Khirana, okay. Did you put anything on the packet? Did you put anything on the packet? No, no, no. There was nothing like that. Okay. The whole packet was packed. Okay. Because in our factory levels, we check all the quality for every product before it comes to the market. But you had such an issue. I will definitely inform this team. Yes. We will check. So, now the packet of noodles you have, is it with the noodles? Yes. No, I took out the noodles separately. And I took out all the things from it. Okay. Yes. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Yes. Yes. Yes. Yes. Yes. Yes. Yes. Yes. Yes. Yes. Yes. Yes. Yes. Yes. Yes. Yes. Yes. Yes. Yes. Yes. Yes. Yes. Yes. Yes. Yes. Yes. Yes. Yes. Yes. Yes. Yes. Yes. Yes. Yes. Yes, tell me. 175 175 79 79 2 2 That's it, right? Yes, yes, 175, 79, 82 82 Yes, yes, 82 at the end. Yes. Please wait for a while. Our executive will call you before he reaches your given address. Yes, yes, he will call on this number, right? Yes, he will call on your number, okay? Okay, how long will it take? I can't confirm the date right now. He will call you before he reaches. Please wait. Okay, fine. Do you need any other information? No, no. Thank you for calling ITS. Have a great day. Thank you.\n",
            "tone": "Happy",
            "sentiment_label": "Positive",
            "keywords": [
                "hindi",
                "e-pika",
                "big cheats",
                "oh",
                "big cheats",
                "okay",
                "okay",
                "roshikesh mishra",
                "pardon",
                "roshikesh mishra",
                "roshikesh",
                "roshikesh mehra",
                "mishra",
                "roshikesh mishra",
                "mishra",
                "mishra",
                "email id",
                "email id",
                "okay",
                "address",
                "vijayanagar",
                "hingna",
                "nagpur",
                "entire address",
                "entire address",
                "entire address",
                "entire address",
                "midc",
                "vijayanagar",
                "hingna",
                "nagpur",
                "hingna",
                "shri krishna nagar",
                "krishna mandir",
                "shri krishna nagar",
                "krishna mandir",
                "shri krishna nagar",
                "shri krishna nagar",
                "pin code",
                "ip",
                "rs",
                "magic masala",
                "mood masala",
                "magic masala",
                "okay",
                "rs",
                "okay",
                "manufacturing",
                "... 23rd",
                "may",
                "may",
                "expiry",
                "expiry",
                "feb",
                "okay",
                "batch number",
                "batch number",
                "batch number",
                "yr01rq01",
                "ca n't",
                "rs",
                "okay",
                "rs",
                "okay",
                "alphanumeric form",
                "yr01rq03",
                "b number",
                "b number",
                "bp444",
                "bp",
                "bp444",
                "bp444",
                "aditya khirana",
                "aditya khirana",
                "okay",
                "whole packet",
                "okay",
                "factory levels",
                "okay",
                "okay",
                "okay",
                "okay",
                "okay",
                "okay",
                "okay",
                "okay",
                "please",
                "okay",
                "ca n't",
                "please",
                "okay",
                "thank",
                "its",
                "have",
                "great day",
                "thank"
            ]
        }
    ],
    "texts": "",
    "summary": "Roshikesh Mehra found that there were issues with the flavour of a Rs. 12 Magic Masala variant of the E-Pika noodles packet he had purchased from Aditya Birla. He calls the customer care of ITC to complain about the issue, and to find out how to return the defective product to have a fresh one dispatched to him. The customer care representative takes down all of Mehra's details, and then reads out the manufacturing and expiration dates, the batch number, and the shop where it was purchased, and assures him that an executive will visit him for collection of the packet. The representative also informs Mehra that the issue he faced is not a standard occurrence as quality is stringently maintained at all levels of packaging and manufacturing.",
    "cohere_points": "- Roshikesh Mehra called the customer care of ITS regarding a cheated packet of Magic Masala E-Pika noodles.\n- He informed them that the manufacturing date was May 23, 2020, and the expiry date was February 13, 2024.\n- The batch number wasYR01RQ01, and the price was Rs. 12.\n- He bought the packet from the Aditya Birla shop. \n- An executive will visit Roshikesh's address for collection.",
    "opening_comments": "No",
    "closing_comments": "No",
    "Topic": "1. Language issue in communication\n2. Complaint registration process\n3. Name and contact details\n4. Address verification\n5. Product variant details\n6. Manufacturing and expiry dates\n7. Batch number inquiry\n8. Shop of purchase\n9. Quality check process\n10. Follow-up call schedule",
    "Resolution": "The customer's issue is not fully resolved as the complaint has been registered and the packet details have been noted for investigation.",
    "diarization": false,
    "Has the Agent Ask for callers Name": "no",
    "Has the Agent Ask for callers Email_id": "yes",
    "Has the Agent Ask for callers Address": "yes",
    "Did the caller Displayed Empathy": "Yes\n\nThe caller displayed empathy when they expressed regret for the inconvenience caused, assured the customer that they would register a complaint, and promised to follow up on the issue. Additionally, the caller patiently listened to the customer's concerns and reassured them that the company would investigate the matter thoroughly.",
    "Was there any profanity on the call": "No.",
    "Interaction": "Query",
    "Discipline": "Brand",
    "Intent": "Collaboration"
}