{
    "segments": [
        {
            "original_transcript": "Good morning. Thank you for calling ATC. My name is Sharath. How may I assist you? What is it? Tell me in Malayalam. What complaint did you file? I told you not to file a complaint. Complaint? About Bingo? What complaint was it? What? What complaint was it? I took an order from the agency but they did not supply it to me. How long has this problem been going on? It was there the last time. Now it has started again. How many days or months has it been? They take the order quickly and supply it on Saturday. How many days has it been now? They did not get it yesterday. Did you call and talk to them? Yes. I called them on Saturday after the order time. They took the order as soon as I called. I told them not to file a complaint on Saturday. I told them to file a complaint on Sunday. Who is this? This is Topan. What is your name? My name is Surya. I don't see any complaint in this. I told you not to file a complaint. Who told you not to file a complaint? I told you. I took an order from the phone company. I told them to supply it on Saturday. I told them not to file a complaint on Saturday. I am asking about the Aravut package. Bingo. Bingo. You are talking about the snacks. Yes. The salesman took the order but did not get the supply. They did not get the supply. Last Sunday. It was Sunday before that. Okay. The package was yellow and orange. I told them to remove it yesterday. They did not do that. Did you call them? Did you call the district or the salesman? He is not answering the phone. He is not answering the phone. No. It was last Saturday. I told him that the package was yellow and orange. I told him to remove it next Sunday. If he did not go. He did not come yesterday. Let me file a complaint. I am asking you to confirm with them. Yes. I told them not to file a complaint. I asked them to do it. In the ITC office. I have to file a complaint. You have to file a complaint. Is the salesman going to remove the package? He is going to remove the package. Is he not going to take the order? He is not going to take the order. It is the salesman who took the order. Okay. The salesman said that the package was yellow and orange. If it did not go, he will remove it next Sunday. Next Sunday is yesterday. Okay. He did not come yesterday. He is not answering the phone. Do you have the distributor's number? Is the distributor the one who took the order? No. The distributor is the one who took the package from the company. Okay. The distributor is the one who took the order from the salesman. The distributor is the one who took the order from the company. Okay. Do you want it? I want it. I am asking you to confirm it again. Otherwise, I will take a complaint. Yesterday, you took the order. Yesterday, you took the order. Okay. I am taking a complaint. I will call you back in a minute. Okay. The salesman took the order. But the distributor did not receive the package. No. The package was yellow and orange. That is why I removed it next Sunday. He did not come yesterday. He is not answering the phone. He is not answering the phone. Okay. Wait for a minute. I will take a complaint. Okay. It has been a week. Yes, it has been a week. Last week, you called me on Saturday. You did not take the complaint. Now, you have waited for a week. But this week, you did not take the complaint. Yes, I waited for a week on Saturday. That is why I did not take the complaint. Okay. Before this, you came and registered the complaint. You got the solution. Then, you will repeat the same mistake, right? Yes, I will repeat the same mistake. It has been a week. Okay. This is Bingo. The problem is with Bingo. I have sold two of them. For Rs.10. Which one is that? There are two of Sunfish Glucose. Okay. I will change it. Okay. They have not changed it. No. Yesterday, you did not come here. Yesterday, I came here. Okay. Is it expired? Or did they change it? It was expired on the 10th of August. Okay. It was expired on the 10th of August. But they did not change it. Yesterday, I came here. Okay. Yesterday, you did not come here. So, it is because of some technical issue, you did not come yesterday. Is it confirmed? We do not know. They did not respond. But we do not know what happened. I asked the next shop. The shop next to mine. Okay. I supplied Bingo there. Did you do it yesterday? Yes, I did it yesterday. Okay. When are you going to call him? I am confirming that there should not be any problem with you. I told him that I will wait for a week to take the complaint. He took the phone and asked me to take the complaint. Okay. I told him not to take it. I will call him on Saturday. Can you tell me the name of the shop? Grandma. Grandma. Yes. One minute. Did you call in a different number that day? How? Do you have a different number? I spoke to the agent that day. I spoke to the agent. One minute. Tell me the number. Eighty-eight. Ninety-three. Grandma. Thirty-three. Let me see. Ninety-four seventy-five. Ninety-four seventy-five? Ninety-four seventy-five. Tell me that number. The rest is the same. Eighty-eight. Ninety-three. Grandma. Thirty-three. Grandma. Is there any other number? Ninety-four seventy-five. Tell me the rest of the numbers. Grandma. It starts with eighty-eight. Ninety-eight. Ninety-three. Grandma. Ninety-four. Grandma. I understand that. Tell me the rest of the numbers. Ninety-four. Ninety-five. Ninety-four. Ninety-five. Grandma. Grandma. Thirty-three. Grandma. Grandma. Only these three numbers. Okay. I have a complaint. Do you know the name Abdul? Huh? Do you know the name Abdul? I spoke to the agent. He said that he has already registered a complaint. That's what I'm asking. How? He said that he has already registered a complaint in your name. Which P.A.D.? Which agent? Didn't you say that last time? Is your place in Kozhikode? Yes. Kozhikode. Kuchiyadi. Karkatti. Okay. Shop Grandma Store? Yes. Calicut? Yes. Didn't you register last year? Last year. One minute from the line. I'll hold the call. Okay. \nThe number you have dialed is currently busy. Have you given a complaint number to the officer? I told you not to make a complaint last week. Did you give a number? I did not give a number. I told him to call me next week. Did you give a number? I did not give a number. I did not even ask him. Who is Radhakrishnan? He is my father. Okay. I have seen a complaint in this name before. That is why I did not ask. I have given it last week. I did not take it now. One minute. I am taking the complaint now. Wait for a minute. Okay. Is this the same name? Grandmaster Kalikattil? Yes. 6 7 3 5 Pooja 7 Yes. This is the same Kalikattil complaint. Okay. I have taken the complaint. Do you know the name of the distributor? Which Kalikattil? Do you know the number? Tell me the number. One minute. Whenever you call, try to call only one number. One minute. Tell me. One minute. The number is not working. Okay. Hello. Tell me. The number is 102. 92 Pooja 7 Pooja 7 82 82 10 84 84 Do you have an email id? I do not have it. Only for the 31st Pooja. Only once. Do you have an email id? Do you have it? Yes. I have the number for the 31st Pooja. Is that RKPA? Yes. Okay. Let me keep the email id here. Okay. Okay. I am registering the complaint. There is no issue with the payment, right? He does not pick up the phone. I do not get any reply. I have called several times. Okay. There is no issue with the payment, right? No. Okay. Okay. There is no issue with the payment, right? There is no issue with the payment, right? There is no issue with the payment, right? No. There is no issue with the payment, right? No. I have registered the complaint. There is one more thing. Try to call from the number you are calling now. When you call from the wrong number, many details will be exposed. It will take some time for us to find out. Okay. So, whenever you call, try to call from a regular number. Okay. Can you give me the number for the 31st Pooja? Both of them will be in the shop. The number is already in my father's name. Okay. The number is already in my father's name. That is why I asked. I will add you here. Okay. Call from the number you are calling now. Okay. Okay. Okay. Can you give me the number for the 31st Pooja? I can't tell you now. I can't check the details here. I have registered the complaint. We will forward it to the particular area. They will take care of the rest. Okay. Do I have to call them every week? Wait for a week. Wait for a week. Call them tomorrow. They will tell you about the complaint. Okay. Call them and see if they respond. We have already registered the complaint. You will get a response accordingly. Okay. Note down the complaint number. 1748 17? 1748 431 Is it 1748 431? Yes, it is 1748 431. Okay. Is it Surak? Yes. What is your full name? Surak Lal. Yes. Okay. I have registered the complaint. Please wait. Okay. Thank you for calling ITS. ",
            "tone": "Neutral",
            "sentiment_label": "Positive",
            "keywords": [
                "good morning",
                "thank",
                "atc",
                "sharath",
                "malayalam",
                "complaint",
                "bingo",
                "order time",
                "who",
                "topan",
                "surya",
                "who",
                "phone company",
                "aravut",
                "bingo",
                "bingo",
                "okay",
                "itc",
                "okay",
                "okay",
                "distributor 's number",
                "okay",
                "okay",
                "otherwise",
                "yesterday",
                "yesterday",
                "okay",
                "okay",
                "okay",
                "wait",
                "okay",
                "okay",
                "okay",
                "bingo",
                "bingo",
                "rs.10",
                "sunfish glucose",
                "okay",
                "okay",
                "yesterday",
                "yesterday",
                "okay",
                "august",
                "okay",
                "august",
                "yesterday",
                "okay",
                "yesterday",
                "technical issue",
                "okay",
                "bingo",
                "okay",
                "okay",
                "grandma",
                "grandma",
                "different number",
                "different number",
                "eighty-eight",
                "ninety-three",
                "grandma",
                "thirty-three",
                "ninety-four",
                "ninety-four",
                "ninety-four",
                "eighty-eight",
                "ninety-three",
                "grandma",
                "thirty-three",
                "grandma",
                "ninety-four",
                "grandma",
                "ninety-eight",
                "ninety-three",
                "grandma",
                "ninety-four",
                "grandma",
                "ninety-four",
                "ninety-five",
                "ninety-four",
                "ninety-five",
                "grandma",
                "grandma",
                "thirty-three",
                "grandma",
                "grandma",
                "okay",
                "abdul",
                "huh",
                "abdul",
                "p.a.d.",
                "kozhikode",
                "kozhikode",
                "kuchiyadi",
                "karkatti",
                "okay",
                "grandma store",
                "calicut",
                "'ll hold",
                "okay",
                "have",
                "complaint number",
                "who",
                "radhakrishnan",
                "okay",
                "wait",
                "okay",
                "grandmaster kalikattil",
                "pooja",
                "kalikattil",
                "okay",
                "kalikattil",
                "whenever",
                "okay",
                "pooja",
                "pooja",
                "email id",
                "pooja",
                "email id",
                "pooja",
                "rkpa",
                "okay",
                "email id",
                "okay",
                "okay",
                "okay",
                "okay",
                "okay",
                "try",
                "wrong number",
                "okay",
                "regular number",
                "okay",
                "pooja",
                "father 's name",
                "okay",
                "father 's name",
                "okay",
                "call",
                "okay",
                "okay",
                "okay",
                "pooja",
                "ca n't",
                "ca n't check",
                "particular area",
                "okay",
                "wait",
                "wait",
                "call",
                "okay",
                "call",
                "okay",
                "complaint number",
                "okay",
                "surak",
                "full name",
                "surak lal",
                "okay",
                "please",
                "okay",
                "thank",
                "its"
            ]
        }
    ],
    "texts": "",
    "summary": "Surya calls the ATC to file a complaint about a supply that he ordered a week ago and has still not received. After arguing with Sharath, the complaint officer, about whether the complaint should be filed or not, Surya explains that he works at ITC and that the complaint is regarding one of their products, Bingo. Surya explains that the salesman took the order but did not get the supply, and that he told the salesman to remove the package, which was yellow and orange, the following Sunday. The salesman did not come yesterday or answer the phone, so Surya wants to file a complaint. Sharath asks for more details and for the distributor's number, but Surya does not have it. Instead, he gives Sharath the phone number that he used to place the order, which Sharath recognizes as the Grandma store in Calicut. Sharath puts Surya on hold to check the number, and while he is on hold, he checks the complaint history and sees that Surya filed a similar complaint the previous year under the name Kalikattil. Sharath takes the complaint and gives Surya the complaint number, 1748 431.",
    "cohere_points": "- Customer wants to register a complaint about a distributor not providing adequate supplies for an order that was placed\n- Customer keeps getting bounced from department to department while trying to resolve the issue\n- Agent takes the complaint and provides a reference number for the complaint \n- Agent advises the customer to call from a regular number and not a disposable one \n- Agent gives the customer a complaint number and suggests waiting a week to see if the issue is resolved",
    "opening_comments": "No",
    "closing_comments": "No",
    "Topic": "1. Order not supplied\n2. Complaint about Bingo\n3. Delayed supply issue\n4. Complaint registration process\n5. Expired product not replaced\n6. Communication with distributor\n7. Lack of response from salesman\n8. Request for complaint number\n9. Contact details verification\n10. Future follow-up instructions",
    "Resolution": "The customer's issue has been registered as a complaint with a complaint number provided, and the complaint will be forwarded to the relevant department for resolution.",
    "Has the Agent Ask for callers Name": "yes",
    "Has the Agent Ask for callers Email_id": "yes",
    "Has the Agent Ask for callers Address": "no",
    "Did the caller Displayed Empathy": "Yes\n\nThe caller displayed empathy when they asked about the well-being and payment issues of the person making the complaint, showing concern for their situation.",
    "Was there any profanity on the call": "No.",
    "Interaction": "Complaint",
    "Discipline": "Brand",
    "Intent": "Collaboration"
}